import random

fr0m=['Серафима','Миша С.','Лиана','Макс','Данила','Саша Т.','Альнур','Назар','Денис','Максим','Настя','Даша','Полина','Глеб','Андрей','Маша','Алёна','Миша Л.','Надя','Нина','Егор','Лёша','Саша М.']
t0=['Серафима','Миша С.','Лиана','Макс','Данила','Саша Т.','Альнур','Назар','Денис','Максим','Настя','Даша','Полина','Глеб','Андрей','Маша','Алёна','Миша Л.','Надя','Нина','Егор','Лёша','Саша М.']
size=len(fr0m)
const=size
print(const)
for i in range(size):
    j=0
    a=random.choice(fr0m)
    b=random.choice(t0)
    while a==b:
        a=random.choice(fr0m)
        b=random.choice(t0)
    print("{}: {} -----> {}".format(i+1,a,b))
    fr0m.remove(a)
    t0.remove(b)

    
